Revit 2027 API
ProjectLocation.GetSiteLocation Method
 Gets the site location to which this project location refers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SiteLocation GetSiteLocation()
Public Function GetSiteLocation As SiteLocation
public:
SiteLocation^ GetSiteLocation()
member GetSiteLocation : unit -> SiteLocation
Return Value
SiteLocation
Remarks
 The site location object contains the longitude, latitude, and time-zone of the entire project site.
See Also
Reference
ProjectLocation Class
Autodesk.Revit.DB Namespace